"""
Шаховий офіцер («слон») ходить по діагоналі. Дано дві різні клітинки
шахової дошки, визначте, чи може офіцер потрапити з першої клітини
на другу за один хід. Програма отримує на вхід чотири числа
від 1 до 8 кожне, що задають номер стовпця і номер рядка спочатку
для першої клітинки, потім для другої клітинки. Програма повинна
вивести Yes, якщо з першої клітинки ходом офіцера можна потрапити
в другу або No в іншому випадку.
Автор: Стерпул Ю.Ю.
"""

start_stovp = int(input("Введіть номер стовпця для першої клітинки (від 1 до 8): "))
start_riad = int(input("Введіть номер рядка для першої клітинки (від 1 до 8): "))
end_stovp = int(input("Введіть номер стовпця для другої клітинки (від 1 до 8): "))
end_riad = int(input("Введіть номер рядка для другої клітинки (від 1 до 8): "))

# Різниця між номерами стовпців і рядків повинна бути однаковою за модулем
stovp_difference = abs(end_stovp - start_stovp)
riad_difference = abs(end_riad - start_riad)

# Перевіряємо можливість ходу офіцера
if stovp_difference == riad_difference:
    print("Yes")
else:
    print("No")
